MahmoudRabea20/ATmega_32-Peripherals/UART_Receive/UART_register.h
/*
 * UART_Receive_register.h
 *
 *  Created on: May 5, 2023
 *      Author: top
 */

#ifndef UART_REGISTER_H_
#define UART_REGISTER_H_

#define UDR                 *((volatile u8*)0x2C)            /* USART I/O Data Register */

#define UCSRA               *((volatile u8*)0x2B)            /* USART Control and Status Register A */
#define UCSRA_RXC           7
#define UCSRA_TXC           6
#define UCSRA_UDRE          5
#define UCSRA_FE            4
#define UCSRA_DOR           3
#define UCSRA_PE            2
#define UCSRA_U2X           1
#define UCSRA_MPCM          0

#define UCSRB               *((volatile u8*)0x2A)            /* USART Control and Status Register B */
#define UCSRB_RXCIE         7
#define UCSRB_TXCIE         6
#define UCSRB_UDRIE         5
#define UCSRB_RXEN          4
#define UCSRB_TXEN          3
#define UCSRB_UCSZ2         2
#define UCSRB_RXB8          1
#define UCSRB_TXB8          0

#define UCSRC               *((volatile u8*)0x40)            /* UUSART Control and Status Register C */
#define UCSRC_URSEL         7
#define UCSRC_UMSEL         6
#define UCSRC_UPM1          5
#define UCSRC_UPM0          4
#define UCSRC_USBS          3
#define UCSRC_UCSZ1         2
#define UCSRC_UCSZ0         1
#define UCSRC_UCPOL         0

#define UBRRH               *((volatile u8*)0x40)            /* USART Baud Rate Registers */
#define UBRRL               *((volatile u8*)0x29)            /*USART Baud Rate Registers */

#endif /* UART_REGISTER_H_ */
